# Using neo4j

## 1. Select query by nodes

### a) Get all nodes

```sql
MATCH (n) RETURN n
```

### b) Get nodes by entity type

``` sql
MATCH (n:<TYPE>) RETURN n
```

### c) Get property 

``` sql
MATCH (n:<TYPE>) RETURN n.<PROPERTY> AS property_name, n.<PROPERTY> as property_name
```

### d) Get nodes by condition

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n
```

### e) LIMIT nodes returned

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n LIMIT num
```


### f) SKIP nodes returned

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n SKIP num (LIMIT num2)
```

### g) ORDER BY nodes returned

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n ORDER BY n.<PROPERTY> (DESC/ASC)
``` 

### h) Filter multiple nodes concurrently

```sql
MATCH (n1:<TYPE>), (n2:<TYPE>) RETURN n1, n2
```

## 2. Select query by relationship

### a) Filter by relationship

```sql
MATCH (n1:<TYPE A>) - [:<RELATION>]-> (n2:<TYPE B>)
WHERE n2.<PROPERTY> = "<value>"
RETURN n1, n2
```
