# Using neo4j

## 1. Select query by nodes

### a) Get all nodes

```sql
MATCH (n) RETURN n
```

### b) Get nodes by entity type

``` sql
MATCH (n:<TYPE>) RETURN n
```

### c) Get property 

``` sql
MATCH (n:<TYPE>) RETURN n.<PROPERTY> AS property_name, n.<PROPERTY> as property_name
```

### d) Get nodes by condition

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n
```

### e) LIMIT nodes returned

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n LIMIT num
```


### f) SKIP nodes returned

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n SKIP num (LIMIT num2)
```

### g) ORDER BY nodes returned

```sql
MATCH (n:<TYPE>) WHERE <CONDITION> RETURN n ORDER BY n.<PROPERTY> (DESC/ASC)
``` 

### h) Filter multiple nodes concurrently

```sql
MATCH (n1:<TYPE>), (n2:<TYPE>) RETURN n1, n2
```

## 2. Select query by relationship

### a) Filter by relationship type

```sql
MATCH (n1:<TYPE A>) - [:<RELATION>]-> (n2:<TYPE B>)
WHERE (CONDITION ON n1.<PROPERTY> and n2.<PROPERTY>)
RETURN n1, n2
```
 
### b) Filter by relationship property

```sql
MATCH (n1:<TYPE A>) - [relation:<RELATION>]-> (n2:<TYPE B>)
WHER (CONDITION ON relation.<PROPERTY>)
RETURN n1, n2
```

### c) Filter by relationship property in comparison with a specific entity

 ```sql
 MATCH(n1:<TYPE A> {<PROPERTY>: property_value}) - [:TEAMMATES] -> (n2:TYPE A)
 RETURN n2
 ```

### c) Filter by relationship property in comparison with a specified entity for a specified condition

```sql
 MATCH (n1:<TYPE A> {<PROPERTY>: property_value}) - [:<RELATION A>] -> (n2:TYPE A)
 MATCH(n2) - [r2:<RELATION B>] -> (n3:<TYPE B>)
 WHERE (CONDITION ON r2.<PROPERTY>)
 RETURN n2
```

### d) Filter by total number of records of relationship

```sql
MATCH (n1:<TYPE A>) - [relation:<RELATION>]-> (n2:<TYPE B>)
RETURN n1.<PROPERTY>, COUNT(relation)
```

### e) Filter by average value of property for relationship

```sql
MATCH (n1:<TYPE A>) - [relation:<RELATION>]-> (n2:<TYPE B>)
RETURN n1.<PROPERTY>, AVG(relation.<PROPERTY>) AS p1
ORDER BY p1 (DESC/ASC)
```



